ИТМ_ОбновлениеВариантовОтчетов_Тесты/src/DataProcessors/ИТМ_ОбновлениеВариантовОтчетов_Интерфейс/ИТМ_ОбновлениеВариантовОтчетов_Интерфейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИТМ_ОбновлениеВариантовОтчетов_Интерфейс</name>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСхемыКомпоновки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаменяемыеПоля</name>
    <attributes>
      <name>Заменять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПутьДо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьПосле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбновляемыеВарианты</name>
    <attributes>
      <name>ВариантОтчета</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменен</name>
      <comment>Изменен ли вариант отчета в результате обработки</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ИТМ_ОбновлениеВариантовОтчетов_Тесты/src/DataProcessors/ИТМ_ОбновлениеВариантовОтчетов_Интерфейс/ObjectModule.bsl
Процедура Инициализировать(Отчет = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
КонецПроцедуры

Процедура СброситьНастройкиОтборов(Отчет = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
КонецПроцедуры

Функция НовоеЗаменяемоеПоле(ПутьДо, ПутьПосле) Экспорт
КонецФункции

Функция НовыйОбновляемыйВариант(ВариантОтчета) Экспорт
КонецФункции

Процедура ЗаполнитьВариантыОтчетов() Экспорт
КонецПроцедуры

Процедура ОбновитьВариантыОтчетов() Экспорт
КонецПроцедуры

Функция ЗаменяемыеПоля() Экспорт
КонецФункции

Процедура ОбработатьНастройкиОтчета(Данные) Экспорт
КонецПроцедуры

Функция ТекстКодаВызоваОбработки() Экспорт
КонецФункции

Функция НовыйПутьПоляКомпоновки(ТекущийПуть, ПутьДо, ПутьПосле) Экспорт
	
	Возврат "";
	
КонецФункции
